<?php
  ////////////////////////////////////////////////////////////////
  // ルートマップの設定
  ////////////////////////////////////////////////////////////////


  # ルートマップ
  /*  ( 参考 )
    0 => [
      0 => GET|POST',
      1 => 'クエリストリングのエイリアス' ( 重複不可 ),
      2 => 'MVC パターン@アクション',
    ],
  */
  $ary_route = [
    // ユーザ権限 A
    0 => [
      0 => [ 0 => 'GET', 1 => 'url_a', 2 => 'index@default' ],

      1 => [ 0 => 'GET', 1 => 'url_b', 2 => 'cata@list' ],
      2 => [ 0 => 'GET', 1 => 'url_c', 2 => 'catb@list' ],
      3 => [ 0 => 'GET', 1 => 'url_d', 2 => 'catc@list' ],
      // 4 => [ 0 => 'GET', 1 => 'url_e', 2 => 'objects@delete' ],
    ],

    // ユーザ権限 B
    // ユーザ権限 C
  ]
?>
